lkolbly/cmsis-svd/data/Cypress/S6E2D3.svd
        <!-- REGISTER "IRQ095MON" -->
        <register>
          <name>IRQ095MON</name>
          <description>IRQ095 Batch Read Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x10F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC ContentStream0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request of the external pin interrupt ch.31</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request of the external pin interrupt ch.30</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request of the external pin interrupt ch.29</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request of the external pin interrupt ch.28</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ096MON" -->
        <register>
          <name>IRQ096MON</name>
          <description>IRQ096 Batch Read Register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x13F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC SafetyStream0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT5" -->
            <field>
              <name>QUDINT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT4" -->
            <field>
              <name>QUDINT4</name>
              <description>Out-of-range interrupt request of QPRC ch.2QPRC ch.2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT3" -->
            <field>
              <name>QUDINT3</name>
              <description>Count inversion interrupt request of QPRC ch.2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT2" -->
            <field>
              <name>QUDINT2</name>
              <description>Overflow / underflow / zero index interrupt request of QPRC ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT1" -->
            <field>
              <name>QUDINT1</name>
              <description>PC and RC match interrupt request of QPRC ch.2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT0" -->
            <field>
              <name>QUDINT0</name>
              <description>PC match interrupt request of QPRC ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ097MON" -->
        <register>
          <name>IRQ097MON</name>
          <description>IRQ097 Batch Read Register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x13F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC DisplayStream0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT5" -->
            <field>
              <name>QUDINT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.3</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT4" -->
            <field>
              <name>QUDINT4</name>
              <description>Out-of-range interrupt request of QPRC ch.3QPRC ch.3</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT3" -->
            <field>
              <name>QUDINT3</name>
              <description>Count inversion interrupt request of QPRC ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT2" -->
            <field>
              <name>QUDINT2</name>
              <description>Overflow / underflow / zero index interrupt request of QPRC ch.3</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT1" -->
            <field>
              <name>QUDINT1</name>
              <description>PC and RC match interrupt request of QPRC ch.3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT0" -->
            <field>
              <name>QUDINT0</name>
              <description>PC match interrupt request of QPRC ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ098MON" -->
        <register>
          <name>IRQ098MON</name>
          <description>IRQ098 Batch Read Register</description>
          <addressOffset>0x38C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x103</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC Signature0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
