lkolbly/cmsis-svd/data/Cypress/S6E2D3.svd
        <!-- REGISTER "IPCR5_1" -->
        <register>
          <name>IPCR5_1</name>
          <description>I2S-PLL Control Register 5</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLM1" -->
            <field>
              <name>IPLLM1</name>
              <description>Frequency division ratio (M) setting bits of the I2S-PLL clock</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "GDCPRE" -->
    <peripheral>
      <name>GDCPRE</name>
      <description>GDC Prescaler</description>
      <version>A</version>
      <groupName>GDCPRE</groupName>
      <baseAddress>0x4003D100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "GDC_CMD_SEQ" -->
      <interrupt>
        <name>GDC_CMD_SEQ</name>
        <value>92</value>
      </interrupt>
      <!-- INTERRUPT "GDC_BLT_ENG" -->
      <interrupt>
        <name>GDC_BLT_ENG</name>
        <value>93</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DRW_ENG" -->
      <interrupt>
        <name>GDC_DRW_ENG</name>
        <value>94</value>
      </interrupt>
      <!-- INTERRUPT "GDC_CONT_STRM0" -->
      <interrupt>
        <name>GDC_CONT_STRM0</name>
        <value>95</value>
      </interrupt>
      <!-- INTERRUPT "GDC_SAFE_STRM0" -->
      <interrupt>
        <name>GDC_SAFE_STRM0</name>
        <value>96</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP_STRM0" -->
      <interrupt>
        <name>GDC_DISP_STRM0</name>
        <value>97</value>
      </interrupt>
      <!-- INTERRUPT "GDC_SIGNA0" -->
      <interrupt>
        <name>GDC_SIGNA0</name>
        <value>98</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP0_SYNC0" -->
      <interrupt>
        <name>GDC_DISP0_SYNC0</name>
        <value>99</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP0_SYNC1" -->
      <interrupt>
        <name>GDC_DISP0_SYNC1</name>
        <value>100</value>
      </interrupt>
      <!-- INTERRUPT "GDC_CONT_STRM1" -->
      <interrupt>
        <name>GDC_CONT_STRM1</name>
        <value>101</value>
      </interrupt>
      <!-- INTERRUPT "GDC_SAFE_STRM1" -->
      <interrupt>
        <name>GDC_SAFE_STRM1</name>
        <value>102</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP_STRM1" -->
      <interrupt>
        <name>GDC_DISP_STRM1</name>
        <value>103</value>
      </interrupt>
      <!-- INTERRUPT "GDC_SIGNA1" -->
      <interrupt>
        <name>GDC_SIGNA1</name>
        <value>104</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP1_SYNC0" -->
      <interrupt>
        <name>GDC_DISP1_SYNC0</name>
        <value>105</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP1_SYNC1" -->
      <interrupt>
        <name>GDC_DISP1_SYNC1</name>
        <value>106</value>
      </interrupt>
      <!-- INTERRUPT "GDC_CAP_PLN0" -->
      <interrupt>
        <name>GDC_CAP_PLN0</name>
        <value>107</value>
      </interrupt>
      <!-- INTERRUPT "GDC_DISP_PLN0" -->
      <interrupt>
        <name>GDC_DISP_PLN0</name>
        <value>108</value>
      </interrupt>
      <!-- INTERRUPT "GDC_STRG_STRM0" -->
      <interrupt>
        <name>GDC_STRG_STRM0</name>
        <value>109</value>
      </interrupt>
      <!-- INTERRUPT "GDC_HISTGRM" -->
      <interrupt>
        <name>GDC_HISTGRM</name>
        <value>110</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "GCCR" -->
        <register>
          <name>GCCR</name>
          <description>GSS Clock Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GSSEN" -->
            <field>
              <name>GSSEN</name>
              <description>GSS clock output enable/disable setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GPCR1" -->
        <register>
          <name>GPCR1</name>
          <description>GSS PLL Control Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPINC" -->
            <field>
              <name>GPINC</name>
              <description>GDC PLL input clock selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GPLLEN" -->
            <field>
              <name>GPLLEN</name>
              <description>GDC PLL enable/disable setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GPCR2" -->
        <register>
          <name>GPCR2</name>
          <description>GSS PLL Control Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPOWT" -->
            <field>
              <name>GPOWT</name>
              <description>PLL clock stabilization wait time set up bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
