lkolbly/cmsis-svd/data/Cypress/S6E2D3.svd
        <!-- REGISTER "GDC_ClockDivider" -->
        <register>
          <name>GDC_ClockDivider</name>
          <description>GDC Clock Generation Control register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCClockSelect" -->
            <field>
              <name>GDCClockSelect</name>
              <description>GDC clock generation control bits</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WkupTriggerMask" -->
        <register>
          <name>WkupTriggerMask</name>
          <description>CPU wake-up trigger Mask register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0707FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WtrigMaskRpc" -->
            <field>
              <name>WtrigMaskRpc</name>
              <description>Wake up trigger mask for HyperBus interface</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WtrigMaskSdram" -->
            <field>
              <name>WtrigMaskSdram</name>
              <description>Wake up trigger mask for SDRAM interface</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WtrigMaskQspi" -->
            <field>
              <name>WtrigMaskQspi</name>
              <description>Wake up trigger mask for QSPI interface</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WtrigMaskGe" -->
            <field>
              <name>WtrigMaskGe</name>
              <description>Wake up trigger mask for GDC Core</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ClockDomainStatus" -->
        <register>
          <name>ClockDomainStatus</name>
          <description>Clock Domain Status Indication register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HsspiClockDomainReady" -->
            <field>
              <name>HsspiClockDomainReady</name>
              <description>Clock Status of QSPI interface clock domain</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RpcClockDomainReady" -->
            <field>
              <name>RpcClockDomainReady</name>
              <description>Clock Status of HyperBus interface clock domain</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SdramClockDomainReady" -->
            <field>
              <name>SdramClockDomainReady</name>
              <description>Clcok Status of SDRAM interface clock domain</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DspClockDomainReady" -->
            <field>
              <name>DspClockDomainReady</name>
              <description>Clock Status of Display clock domain</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp_LockUnlock" -->
        <register>
          <name>dsp_LockUnlock</name>
          <description>Display LockUnlock register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "dsp_LockUnlock" -->
            <field>
              <name>dsp_LockUnlock</name>
              <description>Protection key of this address block setting bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp_LockStatus" -->
        <register>
          <name>dsp_LockStatus</name>
          <description>Display Lock Status indication register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000111</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "dsp_FreezeStatus" -->
            <field>
              <name>dsp_FreezeStatus</name>
              <description>Current status of freeze status</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "dsp_PrivilegeStatus" -->
            <field>
              <name>dsp_PrivilegeStatus</name>
              <description>Current status of provilege protection</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "dsp_LockStatus" -->
            <field>
              <name>dsp_LockStatus</name>
              <description>0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp0_ClockDivider" -->
        <register>
          <name>dsp0_ClockDivider</name>
          <description>Display Clock Divider Ration Setting Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0041E000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "dsp0_ClockDivider" -->
            <field>
              <name>dsp0_ClockDivider</name>
              <description>Division ration from the Reference clock for peripherals</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp0_DomainControl" -->
        <register>
          <name>dsp0_DomainControl</name>
          <description>Display clock domain control register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "dsp0_SoftwareReset" -->
            <field>
              <name>dsp0_SoftwareReset</name>
              <description>Display clock domain software reset</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "dsp0_ClockEnable" -->
            <field>
              <name>dsp0_ClockEnable</name>
              <description>Display clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp0_ClockShift" -->
        <register>
          <name>dsp0_ClockShift</name>
          <description>Register for display clock shift</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00FF0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "dsp0_ClockOffset" -->
            <field>
              <name>dsp0_ClockOffset</name>
              <description>Display clock phase setting bits</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "dsp0_ClockInvert" -->
            <field>
              <name>dsp0_ClockInvert</name>
              <description>Display clock polarity setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp0_PowerEnControl" -->
        <register>
          <name>dsp0_PowerEnControl</name>
          <description>Register for display Power Enable Signal Control</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "Power_Enable" -->
            <field>
              <name>Power_Enable</name>
              <description>Power control of external TFT panel setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp0_ClockGateModeLock" -->
        <register>
          <name>dsp0_ClockGateModeLock</name>
          <description>Display Clock Gate Mode Protection Control register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LockUnlock" -->
            <field>
              <name>LockUnlock</name>
              <description>Protection of this address block setting bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "dsp0_ClockGateControl" -->
        <register>
          <name>dsp0_ClockGateControl</name>
          <description>Display Clock Gate Control register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ClockGate_Enable" -->
            <field>
              <name>ClockGate_Enable</name>
              <description>Dot clock for external TFT panel control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDRAMC_ClockDivider" -->
        <register>
          <name>SDRAMC_ClockDivider</name>
          <description>Division Ratio of SDRAM interface setting register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDRAMC_ClockDivider" -->
            <field>
              <name>SDRAMC_ClockDivider</name>
              <description>Division ratio from the Reference clock for peripherals</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
