lkolbly/cmsis-svd/data/Cypress/S6E2D3.svd
        <!-- REGISTER "vram_sram_select" -->
        <register>
          <name>vram_sram_select</name>
          <description>Size of the ECC protected memory region selection register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "vram_sram_select" -->
            <field>
              <name>vram_sram_select</name>
              <description>Selects the size of the ECC protected region</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "vram_aberraddr_s0" -->
        <register>
          <name>vram_aberraddr_s0</name>
          <description>GDC bus address of the read access at S0 interface which had a single-bit ECC error</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "vram_aberraddr_s0" -->
            <field>
              <name>vram_aberraddr_s0</name>
              <description>Indicates address which had an ECC single bit error</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "vram_aberraddr_s1" -->
        <register>
          <name>vram_aberraddr_s1</name>
          <description>GDC bus address of the read access at S1 interface which had a single-bit ECC error</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "vram_aberraddr_s1" -->
            <field>
              <name>vram_aberraddr_s1</name>
              <description>Indicates address which had an ECC single bit error</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "vram_arbiter_priority" -->
        <register>
          <name>vram_arbiter_priority</name>
          <description>Register assigns fixed arbitration priorities to each GDC bus slave interface</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "vram_priority_s2_read" -->
            <field>
              <name>vram_priority_s2_read</name>
              <description>for internal device test purpose</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "vram_priority_s1_read" -->
            <field>
              <name>vram_priority_s1_read</name>
              <description>set priority of S1 interface for read</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "vram_priority_s0_read" -->
            <field>
              <name>vram_priority_s0_read</name>
              <description>set priority of S0 interface for read</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "vram_priority_s0_write" -->
            <field>
              <name>vram_priority_s0_write</name>
              <description>set priority of S0 interface for write</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SDRAMC" -->
    <peripheral>
      <name>SDRAMC</name>
      <description>GDC Sub system SDRAM Controller</description>
      <version>A</version>
      <groupName>SDRAMC</groupName>
      <baseAddress>0xD0A03000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x104</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x108</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x110</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTBUS_ERR_GDC_SDRAM" -->
      <interrupt>
        <name>EXTBUS_ERR_GDC_SDRAM</name>
        <value>49</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SDMODE" -->
        <register>
          <name>SDMODE</name>
          <description>SDRAM Mode Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001300</resetValue>
          <resetMask>0x0001FF37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSDCLKOFF" -->
            <field>
              <name>MSDCLKOFF</name>
              <description>MSDCLK OFF</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASEL" -->
            <field>
              <name>BASEL</name>
              <description>Bank Address Select</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RASEL" -->
            <field>
              <name>RASEL</name>
              <description>Row Address Select</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CASEL" -->
            <field>
              <name>CASEL</name>
              <description>Column Address Select</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ROFF" -->
            <field>
              <name>ROFF</name>
              <description>Refresh OFF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PDON" -->
            <field>
              <name>PDON</name>
              <description>Power Down ON</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDON" -->
            <field>
              <name>SDON</name>
              <description>SDRAM ON</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REFTIM" -->
        <register>
          <name>REFTIM</name>
          <description>Refresh Timer Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000033</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PREF" -->
            <field>
              <name>PREF</name>
              <description>Pre-Refresh</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NREF" -->
            <field>
              <name>NREF</name>
              <description>Number of Refresh</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REFC" -->
            <field>
              <name>REFC</name>
              <description>Refresh Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWRDWN" -->
        <register>
          <name>PWRDWN</name>
          <description>Power Down Count Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PDC" -->
            <field>
              <name>PDC</name>
              <description>Power Down Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
